In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  0.116174  0.514946 -0.472100 -0.923433
2013-01-02 -1.090179  0.488006  0.426230  0.363193
2013-01-03 -1.615417 -2.143817 -0.575375  1.579995
2013-01-04 -1.133917 -1.392968 -0.888705  1.045945
2013-01-05  0.697140  2.291995 -0.535828 -1.386864
2013-01-06 -0.450077 -1.114137 -0.472980 -1.755581

In [8]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df.to_numpy()

array([[ 0.11617408,  0.51494565, -0.47210015, -0.92343335],
       [-1.09017885,  0.48800575,  0.42623029,  0.3631931 ],
       [-1.61541746, -2.14381714, -0.57537547,  1.57999476],
       [-1.13391707, -1.39296757, -0.88870484,  1.04594509],
       [ 0.69713968,  2.29199497, -0.53582758, -1.38686429],
       [-0.45007745, -1.11413746, -0.47297984, -1.75558052]])

In [11]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.579380 -0.225996 -0.419793 -0.179458
std    0.868541  1.626513  0.442463  1.370201
min   -1.615417 -2.143817 -0.888705 -1.755581
25%   -1.122983 -1.323260 -0.565488 -1.271007
50%   -0.770128 -0.313066 -0.504404 -0.280120
75%   -0.025389  0.508211 -0.472320  0.875257
max    0.697140  2.291995  0.426230  1.579995

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.116174   -1.090179   -1.615417   -1.133917    0.697140   -0.450077
B    0.514946    0.488006   -2.143817   -1.392968    2.291995   -1.114137
C   -0.472100    0.426230   -0.575375   -0.888705   -0.535828   -0.472980
D   -0.923433    0.363193    1.579995    1.045945   -1.386864   -1.755581

In [14]:
df

                   A         B         C         D
2013-01-01  0.116174  0.514946 -0.472100 -0.923433
2013-01-02 -1.090179  0.488006  0.426230  0.363193
2013-01-03 -1.615417 -2.143817 -0.575375  1.579995
2013-01-04 -1.133917 -1.392968 -0.888705  1.045945
2013-01-05  0.697140  2.291995 -0.535828 -1.386864
2013-01-06 -0.450077 -1.114137 -0.472980 -1.755581

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.923433 -0.472100  0.514946  0.116174
2013-01-02  0.363193  0.426230  0.488006 -1.090179
2013-01-03  1.579995 -0.575375 -2.143817 -1.615417
2013-01-04  1.045945 -0.888705 -1.392968 -1.133917
2013-01-05 -1.386864 -0.535828  2.291995  0.697140
2013-01-06 -1.755581 -0.472980 -1.114137 -0.450077

In [16]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01  0.116174  0.514946 -0.472100 -0.923433
2013-01-02 -1.090179  0.488006  0.426230  0.363193
2013-01-03 -1.615417 -2.143817 -0.575375  1.579995
2013-01-04 -1.133917 -1.392968 -0.888705  1.045945
2013-01-05  0.697140  2.291995 -0.535828 -1.386864
2013-01-06 -0.450077 -1.114137 -0.472980 -1.755581

In [17]:
df.sort_values(by='D')

                   A         B         C         D
2013-01-06 -0.450077 -1.114137 -0.472980 -1.755581
2013-01-05  0.697140  2.291995 -0.535828 -1.386864
2013-01-01  0.116174  0.514946 -0.472100 -0.923433
2013-01-02 -1.090179  0.488006  0.426230  0.363193
2013-01-04 -1.133917 -1.392968 -0.888705  1.045945
2013-01-03 -1.615417 -2.143817 -0.575375  1.579995

In [18]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.116174  0.514946
2013-01-02 -1.090179  0.488006
2013-01-03 -1.615417 -2.143817
2013-01-04 -1.133917 -1.392968
2013-01-05  0.697140  2.291995
2013-01-06 -0.450077 -1.114137

In [19]:
df['A']

2013-01-01    0.116174
2013-01-02   -1.090179
2013-01-03   -1.615417
2013-01-04   -1.133917
2013-01-05    0.697140
2013-01-06   -0.450077
Freq: D, Name: A, dtype: float64

In [20]:
df[0:3]

                   A         B         C         D
2013-01-01  0.116174  0.514946 -0.472100 -0.923433
2013-01-02 -1.090179  0.488006  0.426230  0.363193
2013-01-03 -1.615417 -2.143817 -0.575375  1.579995

In [21]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.090179  0.488006  0.426230  0.363193
2013-01-03 -1.615417 -2.143817 -0.575375  1.579995
2013-01-04 -1.133917 -1.392968 -0.888705  1.045945

In [22]:
df.loc[dates[0]]

A    0.116174
B    0.514946
C   -0.472100
D   -0.923433
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.116174  0.514946
2013-01-02 -1.090179  0.488006
2013-01-03 -1.615417 -2.143817
2013-01-04 -1.133917 -1.392968
2013-01-05  0.697140  2.291995
2013-01-06 -0.450077 -1.114137

In [24]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -1.090179  0.488006
2013-01-03 -1.615417 -2.143817
2013-01-04 -1.133917 -1.392968

In [25]:
df.loc[dates[0], 'A']

-0.6371881732147915

In [26]:
df

                   A         B         C         D
2013-01-01 -0.637188 -0.391737 -0.447890 -1.546819
2013-01-02 -0.073603  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299 -0.908007 -1.170346
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063
2013-01-05  0.946256 -0.261561  0.033500 -0.033281
2013-01-06  0.116065  0.604152 -0.474534 -0.011208

In [27]:
df.loc[dates[1], 'A']

-0.07360341946990771

In [28]:
df.at[dates[0], 'A']

-0.6371881732147915

In [29]:
 df.iloc[3]

A   -0.146421
B   -0.375970
C    0.972813
D   -0.538063
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.146421 -0.375970
2013-01-05  0.946256 -0.261561

In [31]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.073603  1.091979
2013-01-03  0.364996 -0.908007
2013-01-05  0.946256  0.033500

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.073603  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299 -0.908007 -1.170346

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.391737 -0.447890
2013-01-02  1.259463  1.091979
2013-01-03  0.293299 -0.908007
2013-01-04 -0.375970  0.972813
2013-01-05 -0.261561  0.033500
2013-01-06  0.604152 -0.474534

In [34]:
df.iloc[1, 1]

1.2594628149651537

In [35]:
df.iat[1, 1]

1.2594628149651537

In [36]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-03  0.364996  0.293299 -0.908007 -1.170346
2013-01-05  0.946256 -0.261561  0.033500 -0.033281
2013-01-06  0.116065  0.604152 -0.474534 -0.011208

In [37]:
df[df['B'] > 0]

                   A         B         C         D
2013-01-02 -0.073603  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299 -0.908007 -1.170346
2013-01-06  0.116065  0.604152 -0.474534 -0.011208

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299       NaN       NaN
2013-01-04       NaN       NaN  0.972813       NaN
2013-01-05  0.946256       NaN  0.033500       NaN
2013-01-06  0.116065  0.604152       NaN       NaN

In [39]:
df2 = df.copy()

In [40]:
df2

                   A         B         C         D
2013-01-01 -0.637188 -0.391737 -0.447890 -1.546819
2013-01-02 -0.073603  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299 -0.908007 -1.170346
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063
2013-01-05  0.946256 -0.261561  0.033500 -0.033281
2013-01-06  0.116065  0.604152 -0.474534 -0.011208

In [41]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [42]:
df2

                   A         B         C         D      E
2013-01-01 -0.637188 -0.391737 -0.447890 -1.546819    one
2013-01-02 -0.073603  1.259463  1.091979  1.890265    one
2013-01-03  0.364996  0.293299 -0.908007 -1.170346    two
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063  three
2013-01-05  0.946256 -0.261561  0.033500 -0.033281   four
2013-01-06  0.116065  0.604152 -0.474534 -0.011208  three

In [43]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.364996  0.293299 -0.908007 -1.170346   two
2013-01-05  0.946256 -0.261561  0.033500 -0.033281  four

In [44]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [45]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df.at[dates[0], 'A'] = 0

In [47]:
df

                   A         B         C         D
2013-01-01  0.000000 -0.391737 -0.447890 -1.546819
2013-01-02 -0.073603  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299 -0.908007 -1.170346
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063
2013-01-05  0.946256 -0.261561  0.033500 -0.033281
2013-01-06  0.116065  0.604152 -0.474534 -0.011208

In [48]:
df.iat[0, 1] = 0

In [49]:
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.447890 -1.546819
2013-01-02 -0.073603  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299 -0.908007 -1.170346
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063
2013-01-05  0.946256 -0.261561  0.033500 -0.033281
2013-01-06  0.116065  0.604152 -0.474534 -0.011208

In [50]:
df2 = df.copy()

In [51]:
df2[df2 > 0] = -df2

In [52]:
df2

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.447890 -1.546819
2013-01-02 -0.073603 -1.259463 -1.091979 -1.890265
2013-01-03 -0.364996 -0.293299 -0.908007 -1.170346
2013-01-04 -0.146421 -0.375970 -0.972813 -0.538063
2013-01-05 -0.946256 -0.261561 -0.033500 -0.033281
2013-01-06 -0.116065 -0.604152 -0.474534 -0.011208

In [53]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [54]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [55]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0
2013-01-03  0.364996  0.293299 -0.908007 -1.170346  NaN
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063  NaN

In [56]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0

In [57]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0
2013-01-03  0.364996  0.293299 -0.908007 -1.170346  NaN
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063  NaN

In [58]:
df3 = df1.dropna(how='any')

df3

In [59]:
df3

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0

In [60]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [61]:
df1

                   A         B         C         D   E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819 NaN
2013-01-02 -0.073603  1.259463  1.091979  1.890265 NaN
2013-01-03  0.364996  0.293299 -0.908007 -1.170346 NaN
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063 NaN

In [62]:
df3

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0

In [63]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [64]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0
2013-01-03  0.364996  0.293299 -0.908007 -1.170346  NaN
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063  NaN

In [65]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0
2013-01-03  0.364996  0.293299 -0.908007 -1.170346  5.0
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063  5.0

In [66]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -0.447890 -1.546819  1.0
2013-01-02 -0.073603  1.259463  1.091979  1.890265  1.0
2013-01-03  0.364996  0.293299 -0.908007 -1.170346  NaN
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063  NaN

In [67]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [68]:
df.mean()

A    0.201215
B    0.253231
C    0.044644
D   -0.234909
dtype: float64

In [69]:
df.mean(1)

2013-01-01   -0.498677
2013-01-02    1.042026
2013-01-03   -0.355015
2013-01-04   -0.021910
2013-01-05    0.171228
2013-01-06    0.058619
Freq: D, dtype: float64

In [70]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [71]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [72]:
df.sub(s, axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -0.635004 -0.706701 -1.908007 -2.170346
2013-01-04 -3.146421 -3.375970 -2.027187 -3.538063
2013-01-05 -4.053744 -5.261561 -4.966500 -5.033281
2013-01-06       NaN       NaN       NaN       NaN

In [73]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.447890 -1.546819
2013-01-02 -0.073603  1.259463  0.644089  0.343446
2013-01-03  0.291392  1.552762 -0.263918 -0.826899
2013-01-04  0.144971  1.176792  0.708895 -1.364963
2013-01-05  1.091227  0.915231  0.742395 -1.398244
2013-01-06  1.207291  1.519383  0.267861 -1.409452

In [74]:
df.apply(lambda x: x.max() - x.min())

A    1.092676
B    1.635433
C    1.999986
D    3.437084
dtype: float64

In [75]:
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.447890 -1.546819
2013-01-02 -0.073603  1.259463  1.091979  1.890265
2013-01-03  0.364996  0.293299 -0.908007 -1.170346
2013-01-04 -0.146421 -0.375970  0.972813 -0.538063
2013-01-05  0.946256 -0.261561  0.033500 -0.033281
2013-01-06  0.116065  0.604152 -0.474534 -0.011208